app/views/quotes/_form.html.erb

SELECT "categories".* FROM "categories"
---
  <div id="categories-container">
    <% @quote.quote_categories.each do |quote_category| %>

SELECT "categories".* FROM "categories"
---
<script>
  document.addEventListener('DOMContentLoaded', function() {
    const addCategoryButton = document.getElementById('add-category');
    const categoriesContainer = document.getElementById('categories-container');

    addCategoryButton.addEventListener('click', function(e) {
      e.preventDefault(); // Prevent the default link behavior
      const newCategoryField = categoriesContainer.querySelector('.category-field').cloneNode(true);
      newCategoryField.querySelector('select').value = ''; // Reset the select value
      categoriesContainer.appendChild(newCategoryField); // Add the new category field
    });
  });