app/views/search/index.html.erb

SELECT "categories".* FROM "categories" INNER JOIN "quote_categories" ON "categories"."id" = "quote_categories"."category_id" WHERE "quote_categories"."quote_id" = ?  [["quote_id", 1]]
---
      <!-- Display categories associated with the quote -->
      <p><strong>Categories:</strong> <%= quote.categories.map(&:categoryName).join(', ') %></p>

SELECT "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
      <!-- Display short biography if it exists -->
      <% if quote.author.authorDescription.present? %>