app/controllers/home_controller.rb

SELECT "quotes".* FROM "quotes" WHERE "quotes"."isPrivate" = ? LIMIT ?  [["isPrivate", 0], ["LIMIT", 5]]
SELECT "users".* FROM "users" WHERE "users"."id" IN (?, ?, ?)  [["id", 2], ["id", 5], ["id", 15]]
SELECT "users".* FROM "users" WHERE "users"."id" IN (?, ?, ?, ?)  [["id", 2], ["id", 5], ["id", 15], ["id", 12]]
---
  def index
    if logged_in?
      # Fetch up to 5 quotes: all public quotes plus the user's private quotes.
      # Uses eager loading with .includes(:user) to minimize database queries.
      @quotes = Quote.includes(:user)
                     .where("isPrivate = ? OR user_id = ?", false, current_user.id)
                     .take(5)
    else
      # Fetch up to 5 public quotes for non-logged-in users.
      @quotes = Quote.includes(:user)
                     .where(isPrivate: false)
                     .take(5)

SELECT "quotes".* FROM "quotes" WHERE "quotes"."user_id" = ?  [["user_id", 2]]
---
  def uquotes
    @quotes = Quote.where(user_id: session[:user_id])