app/controllers/quotes_controller.rb

  def index
    if current_user&.isAdmin
      @quotes = Quote.all
    elsif logged_in?
      @quotes = Quote.where("isPrivate = ? OR user_id = ?", false, current_user.id)
---
SELECT "quotes".* FROM "quotes" WHERE (isPrivate = 0 OR user_id = 2)
SELECT "quotes".* FROM "quotes" WHERE "quotes"."isPrivate" = ?  [["isPrivate", 0]]

  def create
    @quote = Quote.new(quote_params)
    @quote.user = current_user

    respond_to do |format|
      if @quote.save
---
INSERT INTO "quotes" ("isPrivate", "quoteDescription", "comment", "publicationYear", "user_id", "author_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def destroy
    if @quote.destroy
---
DELETE FROM "quotes" WHERE "quotes"."id" = ?  [["id", 8]]