app/controllers/search_controller.rb

  def index
    category_query = params[:category_query] # Retrieve the search term from the query parameters

    if category_query.present?
      # Fetch quotes matching the category name, ensuring that:
      # - Public quotes are included.
      # - The logged-in user can also see their private quotes.
      @quotes_match = Quote.joins(:categories)
                           .where("categories.categoryName LIKE ?", "%#{category_query}%")
                           .where("quotes.isPrivate = ? OR quotes.user_id = ?", false, current_user&.id)
                           .distinct # Avoid duplicate quotes in the search results
---
SELECT "categories".* FROM "categories" INNER JOIN "quote_categories" ON "categories"."id" = "quote_categories"."category_id" WHERE "quote_categories"."quote_id" = ?  [["quote_id", 1]]
SELECT DISTINCT "quotes".* FROM "quotes" INNER JOIN "quote_categories" ON "quote_categories"."quote_id" = "quotes"."id" INNER JOIN "categories" ON "categories"."id" = "quote_categories"."category_id" WHERE (categories.categoryName LIKE '%Logic%') AND (quotes.isPrivate = 0 OR quotes.user_id = 2)