app/controllers/sessions_controller.rb

  def create
    if params[:emailAddress].present?
      user = User.find_by(emailAddress: params[:emailAddress].downcase)
---
SELECT "users".* FROM "users" WHERE "users"."emailAddress" = ? LIMIT ?  [["emailAddress", "admin@myquotes.com"], ["LIMIT", 1]]