app/controllers/users_controller.rb

INSERT INTO "users" ("userFirstName", "userSurname", "emailAddress", "password_digest", "isAdmin", "accountStatus", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)
    @user.accountStatus ||= 'Active'  # Assign 'Active' by default if not specified.

    respond_to do |format|
      if @user.save

UPDATE "users" SET "emailAddress" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["emailAddress", "marwah@gmail.com"], ["password_digest", "[FILTERED]"], ["updated_at", "2024-10-17 13:41:38.410050"], ["id", 20]]
---
  def update
    unless @user == current_user || current_user&.isAdmin
      redirect_to root_path, alert: "Not authorized." and return
    end

    respond_to do |format|
      if @user.update(update_user_params)